src/InformationRegisters/НаработкаЭкземляровКомплектующихИзделийКорабля/НаработкаЭкземляровКомплектующихИзделийКорабля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НаработкаЭкземляровКомплектующихИзделийКорабля</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеСНачалаЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Экземпляр</name>
    <type>
      <types>CatalogRef.ЭкземплярыКомплектующихИзделийКорабля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУчета</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоЦикла</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/РесурсыИСрокиСлужбыПредметовСнабжения/РесурсыИСрокиСлужбыПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РесурсыИСрокиСлужбыПредметовСнабжения</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ТипыПоказателейИзделий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрУчета</name>
    <type>
      <types>CatalogRef.ПараметрыУчетаПоказателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НаработкаЭкземляровКомплектующихИзделийКорабля/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыУчетаНаработки();
	
КонецПроцедуры

//процедура заполняет списки параметров учета наработки исходя из указанных для предмета снабжения
&НаСервере
Процедура ЗаполнитьПараметрыУчетаНаработки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПараметрУчета КАК ПараметрУчета,
	|	МАКСИМУМ(РесурсыИСрокиСлужбыПредметовСнабжения.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.РесурсыИСрокиСлужбыПредметовСнабжения КАК РесурсыИСрокиСлужбыПредметовСнабжения
	|ГДЕ
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПредметСнабжения = &ПредметСнабжения
	|
	|СГРУППИРОВАТЬ ПО
	|	РесурсыИСрокиСлужбыПредметовСнабжения.ПараметрУчета";
	Запрос.УстановитьПараметр("ПредметСнабжения", Запись.Экземпляр.Владелец.ПредметСнабжения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		
	Элементы.ПараметрУчета.СписокВыбора.ЗагрузитьЗначения(ТаблицаЗапроса.ВыгрузитьКолонку("ПараметрУчета"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаКорректна(Дата, Экземпляр)
	
	ДатаВвода = Экземпляр.ДатаВвода;
	
	Возврат Не ЗначениеЗаполнено(ДатаВвода) Или Дата > ДатаВвода;
	
КонецФункции

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Запись.Период > ТекущаяДата() Тогда
		
		Сообщить("Введенная дата больше текущей!");
		Запись.Период = Дата("00010101");
		
	ИначеЕсли Не ДатаКорректна(Запись.Период, Запись.Экземпляр) Тогда
		
		Сообщить("Введенная дата меньше даты ввода в эксплуатацию!");
		Запись.Период = Дата("00010101");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрУчетаПриИзменении(Элемент)

	Запись.ЕдиницаИзмерения = ПолучитьЗначениеРеквизита(Запись.ПараметрУчета, "ЕдиницаИзмерения");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита)
	
	Возврат Ссылка[ИмяРеквизита];
	
КонецФункции
